########################################################################################################################
## Django 自带模块导入
########################################################################################################################
from django.conf.urls import url, include
from django.views.static import serve
from opms_project import settings

########################################################################################################################
## 系统自带模块导入
########################################################################################################################


########################################################################################################################
## 自建模块导入
########################################################################################################################
from .views import *


app_name = 'message'

########################################################################################################################
## url
########################################################################################################################
urlpatterns = [
    # 用户反馈
    url(r'^feedback/$', UserFeedbackMessageView.as_view(), name='feedback_message'),

    # 用户消息
    url(r'^list/$', UserMessageListView.as_view(), name='message_list'),

    # 用户发送消息
    url(r'^send/message$', UserSendMessageView.as_view(), name='send_message'),

    # 用户发送评论
    url(r'^send/comment$', UserSendCommentView.as_view(), name='send_comment'),

    # 用户删除评论
    url(r'^delete/comment$', UserDeleteCommentView.as_view(), name='delete_comment'),

    # 标记已读
    url(r'^change/read$', ChangeReadStatusView.as_view(), name='change_read'),
]



